Revit 2026 API

# StoneApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "StoneApplication" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StoneApplicationType
```
```vb
Public Enumeration StoneApplicationType
```
```cpp
public enum class StoneApplicationType
```
```fsharp
type StoneApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Glossy | 1 |  |
| Matte | 2 |  |
| Polished | 0 |  |
| Unfinished | 3 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace